import numpy as np
import matplotlib.pyplot as plt
from interpolate import gait_interpld
# 读取文本文件
# data_1 = np.genfromtxt('/home/leovento/Robot-learning/Isaacgym/siat_exo/urdf_test/gait/gait_0403.txt', delimiter=' ')  # 根据实际情况指定分隔符
# data_2 = np.genfromtxt('/home/leovento/Robot-learning/Isaacgym/siat_exo/urdf_test/gait/gait_0403_2.txt', delimiter=' ')
# data = data_1 - data_2
data = np.genfromtxt('/home/leovento/Robot-learning/Isaacgym/siat_exo/urdf_test/gait/gait_0413.txt', delimiter=' ')
#data = gait_interpld(data)/3.1415926*180
data = data/3.1415926*180
data_v = np.diff(data,axis=0)*1000*60/360
#np.savetxt('my_gait_0328.txt', data, delimiter='\t')
# 获取列数

num_cols = data.shape[1]

plt.figure()
#对每一列数据绘制曲线图，分别显示在不同的图窗中
for i in range(num_cols):
    
    plt.plot(data[:, i])
    plt.title(f'Column {i+1}')
    plt.xlabel('Index')
    plt.ylabel('Value')
    plt.grid(True)

plt.figure()
#对每一列数据绘制曲线图，分别显示在不同的图窗中
for i in range(num_cols):
    
    plt.plot(data_v[10:, i])
    plt.title(f'Column {i+1}')
    plt.xlabel('Index')
    plt.ylabel('Value')
    plt.grid(True)
plt.show()

# q1=np.array([ 1.799336405379038e-01,  2.851098726556574e-06,
#        -5.168314279895453e-01,  9.916994318136005e-01,
#        -4.748564690755868e-01, -1.799299673073113e-01,
#         1.638709499915645e-01,  2.960479068961954e-06,
#        -3.215666054734030e-01,  7.202345338835530e-01,
#        -3.986565731456074e-01, -1.638672767610743e-01])

# q2=np.array([ 1.799409127213263e-01,  2.851068268214164e-06,
#        -5.169463350482300e-01,  9.918338892951775e-01,
#        -4.748760195311699e-01, -1.799372394907340e-01,
#         1.638709500298004e-01,  2.960479068807216e-06,
#        -3.215492158061258e-01,  7.202327173435337e-01,
#        -3.986721462728654e-01, -1.638672767993103e-01])

# q3=np.array([ 1.799457613935302e-01,  2.851047960597665e-06,
#        -5.170370007189352e-01,  9.919208409654628e-01,
#        -4.748723055525468e-01, -1.799420881629381e-01,
#         1.638709500709776e-01,  2.960479068650087e-06,
#        -3.215304878255299e-01,  7.202307596794659e-01,
#        -3.986889165893938e-01, -1.638672768404874e-01])

# q4=np.array([ 1.799530345622964e-01,  2.851017498526016e-06,
#        -5.171382352046932e-01,  9.920578319054257e-01,
#        -4.749080620394475e-01, -1.799493613317046e-01,
#         1.638709501121548e-01,  2.960479068459818e-06,
#        -3.215117590033476e-01,  7.202288002059717e-01,
#        -3.987056859380820e-01, -1.638672768816647e-01])

# q5=np.array([ 1.799578838702968e-01,  2.850997188523411e-06,
#        -5.172288898087447e-01,  9.921447510443091e-01,
#        -4.749043265960792e-01, -1.799542106397050e-01,
#         1.638709501533319e-01,  2.960479068308745e-06,
#        -3.214930293938175e-01,  7.202268390396358e-01,
#        -3.987224543812765e-01, -1.638672769228418e-01])

# q6=np.array([ 1.799651579927861e-01,  2.850966722857707e-06,
#        -5.173301099010322e-01,  9.922817008260603e-01,
#        -4.749400563182433e-01, -1.799614847621946e-01,
#         1.638709501945092e-01,  2.960479068156848e-06,
#        -3.214742989969452e-01,  7.202248761804477e-01,
#        -3.987392219189609e-01, -1.638672769640190e-01])


# q = np.vstack((q1,q2,q3,q4,q5,q6))

# num_cols = q.shape[1]


# #对每一列数据绘制曲线图，分别显示在不同的图窗中
# for i in range(num_cols):
#     plt.figure()
#     plt.plot(q[:, i])
#     plt.title(f'Column {i+1}')
#     plt.xlabel('Index')
#     plt.ylabel('Value')
#     plt.grid(True)
# plt.show()